* PromQL Prettier
Have trouble in reading [[https://prometheus.io/docs/prometheus/latest/querying/basics/][PromQL]] written by your colleagues or SRE team?

=promql-prettier= to the rescue!

* Install
- Thanks for [[https://github.com/golang/go/wiki/WebAssembly][WebAssembly]], you can use it [[https://liujiacai.net/promql-prettier/][online]]. 🍺
- Or you can download in [[https://github.com/jiacai2050/promql-prettier/releases][releases]] and integrate with your favorite editors.

* Examples
#+begin_src bash :results output example :exports results
cat ./docs/promql.txt | while read line
do
echo -e "Original:\n${line}\nPretty print:"
echo "$line" | promql-prettier
echo -e "\n"
done
#+end_src

#+RESULTS:
#+begin_example
Original:
go_goroutines{instance!="localhost:9090", job!~"prometheus.*"}
Pretty print:
go_goroutines{instance!="localhost:9090", job!~"prometheus.*"}

Original:
{__name__="go_goroutines",instance="localhost:9090",job="prometheus"}
Pretty print:
go_goroutines{instance="localhost:9090", job="prometheus"}

Original:
(((metric_name_long)))
Pretty print:
metric_name_long

Original:
histogram_quantile(0.9, rate(instance_cpu_time_seconds{app="lion", proc="web",job="cluster-manager"}[5m]))
Pretty print:
histogram_quantile (
  0.9,
  rate (
    instance_cpu_time_seconds{app="lion", proc="web", job="cluster-manager"}[5m:]
  )
)

Original:
topk(5, (sum without(env) (instance_cpu_time_ns{app="lion", proc="web", rev="34d0f99", env="prod", job="cluster-manager"})))
Pretty print:
topk (
  5,
  sum without (env) (
    instance_cpu_time_ns{app="lion", proc="web", rev="34d0f99", env="prod", job="cluster-manager"}
  )
)

Original:
sum (instance_cpu_time_ns{app="lion", proc="web", rev="34d0f99", env="prod", job="cluster-manager"}) without (label)
Pretty print:
sum without (label) (
  instance_cpu_time_ns{app="lion", proc="web", rev="34d0f99", env="prod", job="cluster-manager"}
)

Original:
sum (instance_cpu_time_ns{app="lion", proc="web", rev="34d0f99", env="prod", job="cluster-manager"} + http_request_total{job="apiserver", handler="/api/comments"}) without (label)
Pretty print:
sum without (label) (
    instance_cpu_time_ns{app="lion", proc="web", rev="34d0f99", env="prod", job="cluster-manager"}
  +
    http_request_total{job="apiserver", handler="/api/comments"}
)

Original:
first_long{foo="bar", hello="world"} + second{foo="bar"} + third{foo="bar", localhost="9090"} + forth
Pretty print:
  (
      (
          first_long{foo="bar", hello="world"}
        +
          second{foo="bar"}
      )
    +
      third{foo="bar", localhost="9090"}
  )
+
  forth

#+end_example

* Editor integration
** Emacs
#+BEGIN_SRC emacs-lisp
(defun my/promql-fmt (s e)
  (interactive "r")
  (shell-command-on-region s e "promql-prettier"
                           :replace t))
#+END_SRC

* Reference
- [[https://docs.google.com/document/d/1nOBjpuCk4CsrOSm2ZjfVz2EL6gmA_CFGSbHCdY0Royg/edit#heading=h.yvhtbjuned2s][PromQL prettier - design doc]]
